/*
* 公告栏
* */

export default {
  'GET /noticeBoard/noteData':[
      {
        noteId: '1',
        title: '20190114账期数据波动说明',
        name: '张三',
        date: '2019-1-16',
        content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
      }, {
        noteId: '2',
        title: '20190114账期数据波动说明',
        name: '张三',
        date: '2019-1-16',
        content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
      },
      {
        noteId: '3',
        title: '20190114账期数据波动说明',
        name: '张三',
        date: '2019-1-16',
        content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
      },
      {
        noteId: '4',
        title: '20190114账期数据波动说明',
        name: '张三',
        date: '2019-1-16',
        content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
      },
      {
        noteId: '5',
        title: '20190114账期数据波动说明',
        name: '张三',
        date: '2019-1-16',
        content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
      }

  ],
  'GET /noticeBoard/anomalyIndex':[
    {
      key: '1',
      noteId: '6',
      title: '20190114账期数据波动说明',
      name: '张三',
      date: '2019-1-16',
      content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
    }, {
      key: '2',
      noteId: '7',
      title: '20190114账期数据波动说明',
      name: '张三',
      date: '2019-1-16',
      content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
    },
    {
      key: '3',
      noteId: '8',
      title: '20190114账期数据波动说明',
      name: '张三',
      date: '2019-1-16',
      content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
    },
    {
      key: '4',
      noteId: '9',
      title: '20190114账期数据波动说明',
      name: '张三',
      date: '2019-1-16',
      content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
    },
    {
      key: '5',
      noteId: '10',
      title: '20190114账期数据波动说明',
      name: '张三',
      date: '2019-1-16',
      content:'20190114账期甘肃固话用户资料上传有误，导致全国和甘肃固话网上用户减少2.6万户，固话用户类相关指标暂不可用。'
    }

  ]
}
