export default {
  'GET /systemOperator/tableData':[
    [
      "d45e973e-bbd5-4962-b181-aea539e418d1"
      ,"2019-01-18"
      ,"运营总览"
      ,"排版不合理"
      ,"业务专题——移网业务——日关注——运营概况。下载全部——当日值和下面的日均环比/本月累计/累计同比表头顺序不一致，从1月14日开始不一致的，只有当日值有此现象，希望尽快调整和下面下载顺序一致，14日以前一直是好的。"
      ,"孟涛"
      ,"市场营销部"
      ,"mengtao10"
      ,"15603460815"
      ,"mengtao10@chinaunicom.cn"
      ,"Chrome 55"
      ,"1"
      ,"-"
    ],
    [
      "d45e973e-bbd5-4962-b181-aea539e418d1"
      ,"2019-01-18"
      ,"运营总览"
      ,"排版不合理"
      ,"业务专题——移网业务——日关注——运营概况。下载全部——当日值和下面的日均环比/本月累计/累计同比表头顺序不一致，从1月14日开始不一致的，只有当日值有此现象，希望尽快调整和下面下载顺序一致，14日以前一直是好的。"
      ,"孟涛"
      ,"市场营销部"
      ,"mengtao10"
      ,"15603460815"
      ,"mengtao10@chinaunicom.cn"
      ,"Chrome 55"
      ,"1"
      ,"-"
    ],
    [
      "d45e973e-bbd5-4962-b181-aea539e418d1"
      ,"2019-01-18"
      ,"运营总览"
      ,"排版不合理"
      ,"业务专题——移网业务——日关注——运营概况。下载全部——当日值和下面的日均环比/本月累计/累计同比表头顺序不一致，从1月14日开始不一致的，只有当日值有此现象，希望尽快调整和下面下载顺序一致，14日以前一直是好的。"
      ,"孟涛"
      ,"市场营销部"
      ,"mengtao10"
      ,"15603460815"
      ,"mengtao10@chinaunicom.cn"
      ,"Chrome 55"
      ,"1"
      ,"-"
    ],
    [
      "d45e973e-bbd5-4962-b181-aea539e418d1"
      ,"2019-01-18"
      ,"运营总览"
      ,"排版不合理"
      ,"业务专题——移网业务——日关注——运营概况。下载全部——当日值和下面的日均环比/本月累计/累计同比表头顺序不一致，从1月14日开始不一致的，只有当日值有此现象，希望尽快调整和下面下载顺序一致，14日以前一直是好的。"
      ,"孟涛"
      ,"市场营销部"
      ,"mengtao10"
      ,"15603460815"
      ,"mengtao10@chinaunicom.cn"
      ,"Chrome 55"
      ,"1"
      ,"-"
    ],
  ]
}
