/*
* 运营总揽日的政企业务组件请求接口
 */
import request from '../utils/request';
import Url from '@/services/urls.json';


// 专题的
export function fetchOperationData(params) {
  console.log(params);
  return request(`${Url.urls[50].url}/operatingPlate`, {
    method: 'POST',
    body: params,
  });
  // return new Promise((resolve)=>{
  //  const resData={
  //    "data":{
  //      "title":"运营公司",
  //      "list":[
  //        {
  //          "title":"移网基础",
  //          "itemList":[
  //            {
  //              "itemTitle":"宽带业务计费收入",
  //              "itemValue":[
  //                {"name":"月累计","value":"3,928,293","unit":"元"},
  //                {"name":"日均环比","value":"64","unit":"%"}
  //              ]
  //            }
  //          ]
  //        },
  //        {
  //          "title":"固网基础",
  //          "itemList":[
  //            {
  //              "itemTitle":"宽带业务计费收入",
  //              "itemValue":[
  //                {"name":"月累计","value":"3,928,293","unit":"元"},
  //                {"name":"日均环比","value":"64","unit":"%"}
  //              ]
  //            },
  //            {
  //              "itemTitle":"宽带业务计费收入",
  //              "itemValue":[
  //                {"name":"月累计","value":"3,928,293","unit":"元"},
  //                {"name":"日均环比","value":"64","unit":"%"}
  //              ]
  //            },
  //            {
  //              "itemTitle":"宽带业务计费收入",
  //              "itemValue":[
  //                {"name":"月累计","value":"3,928,293","unit":"元"},
  //                {"name":"日均环比","value":"64","unit":"%"}
  //              ]
  //            }
  //          ]
  //        }
  //      ]
  //    },
  //    "code":"200",
  //    "message":"成功"
  //  };
  //   resolve(resData)
  // });

}

// 临时调试专用
export function fetchStackBarData(params) {
  return request(`${Url.urls[50].url}/incomeAnalysisEchart`, {
    method: 'POST',
    body: params,
  });
  // return new Promise((resolve)=>{
  //   const resData={
  //     "data":{
  //       "subtitle":"",
  //       "yName":"单位：万户",
  //       "title":"宽带趸交qwr",
  //       "xName":"",
  //       "chartX":["北京","天津","河北","山西","内蒙古","辽宁","吉林","黑龙江","山东","河南","上海","江苏","浙江","安徽","福建","江西","湖北","湖南","广东","广西","海南","重庆","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆"],
  //       "chart":[
  //         {
  //           "unit":"万户",
  //           "name":"趸交宽带数",
  //           "type":"bar",
  //           "value":["125.67","2.17","184.41","72.88","57.53","158.22","193.86","55.85","344.84","134.34","11.24","2.43","73.30","32.79","54.15","36.02","27.56","57.85","4.19","4.03","6.71","49.23","31.72","9.46","86.34","0.42","17.86","3.23","6.37","0.88","2.67"]
  //         },
  //         {
  //           "unit":"万户",
  //           "name":"非趸交宽带数",
  //           "type":"bar",
  //           "value":["261.73","282.10","693.35","382.64","218.87","416.36","90.83","284.58","1,014.17","956.45","43.66","170.12","80.40","98.08","139.48","36.11","173.42","218.71","308.52","94.35","27.13","94.54","100.13","107.47","26.52","1.29","95.03","13.55","21.26","8.48","41.08"]
  //         },
  //         {
  //           "unit":"万户",
  //           "name":"非趸交x宽带数",
  //           "type":"bar",
  //           "value":["261.73","282.10","693.35","382.64","218.87","416.36","90.83","284.58","1,014.17","956.45","43.66","170.12","80.40","98.08","139.48","36.11","173.42","218.71","308.52","94.35","27.13","94.54","100.13","107.47","26.52","1.29","95.03","13.55","21.26","8.48","41.08"]
  //         },
  //         {
  //           "unit":"万户",
  //           "name":"非趸交y宽带数",
  //           "type":"bar",
  //           "value":["261.73","282.10","693.35","382.64","218.87","416.36","90.83","284.58","1,014.17","956.45","43.66","170.12","80.40","98.08","139.48","36.11","173.42","218.71","308.52","94.35","27.13","94.54","100.13","107.47","26.52","1.29","95.03","13.55","21.26","8.48","41.08"]
  //         }
  //       ]
  //     },
  //     "code":"200",
  //     "message":"成功"
  //   };
  //   resolve(resData)
  // });
}

// 临时调试专用
export function fetchProductData(params) {
  return request(`${Url.urls[50].url}/barLineEchart`, {
    method: 'POST',
    body: params,
  });
  // return new Promise((resolve)=>{
  //   const resData={
  //     "data":{
  //       "title": "集成板块",
  //       "header": {
  //         "title": "创新业务项目预算收入",
  //         "list": [{
  //           "name": "月累计",
  //           "value": "3,928,293",
  //           "unit": "元"
  //         },
  //           {
  //             "name": "日均环比",
  //             "value": "64",
  //             "unit": "％"
  //           }
  //         ]
  //       },
  //       "echart": {
  //         "xName":"单位：元",
  //         "yName":["单位：元","单位：%"],
  //         "title": "在网5G终端占比",
  //         "chartX": ["山西", "陕西", "吉林", "11", "华为", "黑龙筋", "云南", "贵州", "华为", "哈哈"],
  //         "chart": [{
  //           "name": "终端数量",
  //           "value": ["1500", "1250", "680", "1500", "1050", "1400", "1380", "1160", "1300", "1270"],
  //           "unit": "数量",
  //           "type": "bar"
  //         },
  //           {
  //             "name": "占比",
  //             "value": ["90", "80", "40", "90", "70", "85", "80", "75", "83", "80"],
  //             "unit": "%",
  //             "type": "line"
  //           }
  //         ]
  //       }
  //     },
  //     "code":"200",
  //     "message":"成功"
  //   };
  //   resolve(resData)
  // });
}

// 临时调试专用
export function fetchIntegrationData(params) {
  return request(`${Url.urls[50].url}/barLineEchart`, {
    method: 'POST',
    body: params,
  });
  // return new Promise((resolve)=>{
  //   const resData={
  //     "data":{
  //       "title": "集成板块",
  //       "header": {
  //         "title": "创新业务项目预算收入",
  //         "list": [{
  //           "name": "月累计",
  //           "value": "3,928,293",
  //           "unit": "元"
  //         },
  //           {
  //             "name": "日均环比",
  //             "value": "64",
  //             "unit": "％"
  //           }
  //         ]
  //       },
  //       "echart": {
  //         "xName":"单位：元",
  //         "yName":["单位：元","单位：%"],
  //         "title": "在网5G终端占比",
  //         "chartX": ["山西", "陕西", "吉林", "11", "华为", "黑龙筋", "云南", "贵州", "华为", "哈哈"],
  //         "chart": [{
  //           "name": "终端数量",
  //           "value": ["1500", "1250", "680", "1500", "1050", "1400", "1380", "1160", "1300", "1270"],
  //           "unit": "数量",
  //           "type": "bar"
  //         },
  //           {
  //             "name": "占比",
  //             "value": ["90", "80", "40", "90", "70", "85", "80", "75", "83", "80"],
  //             "unit": "%",
  //             "type": "line"
  //           }
  //         ]
  //       }
  //     },
  //     "code":"200",
  //     "message":"成功"
  //   };
  //   resolve(resData)
  // });
}

// 临时调试专用
export function fetchBusinessData(params) {
  console.log(params);
  return request(`${Url.urls[50].url}/innovateBusiness`, {
    method: 'POST',
    body: params,
  });
  // return new Promise((resolve)=>{
  //   const resData={
  //     "data":{
  //       "title": "创新业务",
  //       "thData": [
  //         {
  //           "title": "业务名称",
  //           "dataIndex": "name",
  //           "unit": ""
  //         },
  //         {
  //           "title": "月累计",
  //           "dataIndex": "month",
  //           "unit": "元"
  //         },
  //         {
  //           "title": "日环均比",
  //           "dataIndex": "day",
  //           "unit": "%"
  //         }
  //       ],
  //       "list": [
  //         {
  //           "title": "物联网1",
  //           "tbodyData": [
  //             {
  //               "key": "1",
  //               "name": "物联网部件和应用计费",
  //               "month": "27,244,645",
  //               "day": "38"
  //             },
  //             {
  //               "key": "2",
  //               "name": "物联网集成计收收入",
  //               "month": "525,229",
  //               "day": "83"
  //             },
  //             {
  //               "key": "3",
  //               "name": "大数据标准产品计费收入",
  //               "month": "235,518",
  //               "day": "54"
  //             },
  //           ]
  //         },
  //         {
  //           "title": "物联网2",
  //           "tbodyData": [
  //             {
  //               "key": "11",
  //               "name": "物联网部件和应用计费",
  //               "month": "27,244,645",
  //               "day": "38"
  //             },
  //             {
  //               "key": "21",
  //               "name": "物联网集成计收收入",
  //               "month": "525,229",
  //               "day": "83"
  //             },
  //             {
  //               "key": "31",
  //               "name": "大数据标准产品计费收入",
  //               "month": "235,518",
  //               "day": "54"
  //             },
  //           ]
  //         },
  //         {
  //           "title": "物联网3",
  //           "tbodyData": [
  //             {
  //               "key": "12",
  //               "name": "物联网部件和应用计费",
  //               "month": "27,244,645",
  //               "day": "38"
  //             },
  //             {
  //               "key": "22",
  //               "name": "物联网集成计收收入",
  //               "month": "525,229",
  //               "day": "83"
  //             },
  //             {
  //               "key": "32",
  //               "name": "大数据标准产品计费收入",
  //               "month": "235,518",
  //               "day": "54"
  //             },
  //           ]
  //         },
  //         {
  //           "title": "物联网4",
  //           "tbodyData": [
  //             {
  //               "key": "18",
  //               "name": "物联网部件和应用计费",
  //               "month": "27,244,645",
  //               "day": "38"
  //             },
  //             {
  //               "key": "28",
  //               "name": "物联网集成计收收入",
  //               "month": "525,229",
  //               "day": "83"
  //             },
  //             {
  //               "key": "38",
  //               "name": "大数据标准产品计费收入",
  //               "month": "235,518",
  //               "day": "54"
  //             },
  //           ]
  //         },
  //       ]
  //     },
  //     "code":"200",
  //     "message":"成功"
  //   };
  //   resolve(resData)
  // });
}

